"""
This script is for all prompt
"""
class PromptFormat:
    """
    A class for prompt format
    """
    PROMPT = (
        "我現在需要辨識輪轉遊戲畫面上的按鍵與非按鍵，"
        "遊戲畫面上的按鍵可能有<button>增加押注</button>、<button>減少押注</button>、<button>開始輪轉</button>、"
        "<button>工具列</button>、<button>關閉</button>、<button>返回主頁</button>、<button>遊戲資訊</button>、"
        "<button>快速</button>、<button>額外押注</button>、<button>最大押注</button>等按鍵。"
        "以下為按鍵的特徵，請**依照特徵辨識**："
        "<button>增加押注</button>上會有**+**的符號或是**增加**。"
        "<button>減少押注</button>上會有**-**的符號或是**減少**。"
        "<button>遊戲資訊</button>上會有字母**i**或是**info**的字"
        "<button>工具列</button>上會有**3個點**的符號。"
        "<button>返回主頁</button>上會有**房子**的符號。"
        "<button>關閉</button>上會有**X**或是**叉叉**的符號。"
        "<button>最大押注</button>上只會有**中文**字**最大押注**。"
        "<button>額外押注</button>上會有**中文**字**額外押注**。"
        "除了以上的按鍵，其餘皆當作非按鍵"
        "請幫我辨識這張圖片是不是按鍵，請在標籤`<answer></answer>`內輸出是<answer>是</answer>或者<answer>不是</answer>"
        "如果是按鍵的話，在標籤`<button></button>`內輸出是哪一類按鍵。"
    )

class GetValuePromptFormat:
    """
        A class for prompt format of getting value
    """
    PROMPT = (
        """
            我想要辨識一款slot game的遊戲畫面中的數字，並且要知道數字的意義。

            以下是slot game中主要要獲得的信息(僅供參考，實際上可能會出現其他重要信息):
                玩家贏得的分數(ex:玩家贏分)
                玩家剩餘金額(ex:玩家剩餘金額)
                每局的押注金額(ex:押注金額)
                各種獎項金額

            請幫我辨識遊戲畫面中的數字，並告訴我數字的意義，要符合以下條件:
            1.只保留重要的信息
            2.數字要用<number></number>標籤包起來，意義要用<meaning></meaning>標籤包起來
            3.輸出格式<number></number> = <meaning></meaning>
            4.回答盡量精簡
            
        """
    )

class GetSimplifiedMeaningPromptFormat:
    """
        A class for prompt format of getting value
    """
    PROMPT = (
        """
            我正在辨識一款slot game的遊戲畫面中的數字，但我得到數字的數值和數字的位置了，卻不知道它的意義，所以我記錄了這些數字的位置和這些數字可能的意義。
            請你為每一筆資料進行可信度評分，規則如下:
            1.若一個位置的意義越多，則可信度越高。
            2.若一個位置的意義越重複，則可信度越高。
    
            以下是slot game中重要的信息(僅供參考，實際上可能會出現其他重要信息):
                玩家贏得的分數(ex:玩家贏分)
                玩家剩餘金額(ex:玩家剩餘金額)
                每局的押注金額(ex:押注金額)
                各種獎項金額
    
            請幫我整理位置對上意義，並符合以下條件:
            1.只輸出重要的信息
            2.若不同位置出現相同的意義請選擇可信度較高的(獎項金額除外)
            3.位置要用<position></position>標籤包起來，意義要用<meaning></meaning>標籤包起來
            4.輸出格式<position></position> = <meaning></meaning>
            5.回答盡量精簡
            
            範例:
            {'roi': [72, 65, 96, 14], 'value': ['94,110,589', '94,110,389', '94,110,039', '94,109,639', '94,109,239', '94,108,989', '94,108,689', '94,108,639', '94,108,289', '94,108,289'], 'meaning': ['玩家剩餘金額', '玩家剩餘金額', '玩家剩餘金額', '玩家剩餘金額', '玩家剩餘金額', '玩家剩餘金額', '玩家剩餘金額', '玩家剩餘金額', '玩家剩餘金額', '玩家剩餘金額']}
            {'roi': [211, 145, 88, 18], 'value': ['49,378,507', '49,378,528', '49,378,550', '49,378,560', '49,378,570', '49,378,578', '49,378,586', '49,378,591', '49,378,594', '49,378,597'], 'meaning': ['巨獎金額', '巨獎金額', '巨獎金額', '巨獎金額', '巨獎金額', '巨獎金額', '巨獎金額', '巨獎金額', '巨獎金額', '巨獎金額']}
            {'roi': [110, 194, 49, 15], 'value': ['50,000', '50,000', '50,000', '50,000', '50,000', '50,000', '50,000', '50,000', '50,000', '50,000'], 'meaning': ['大獎金額', '大獎金額', '大獎金額', '大獎金額', '大獎金額', '大獎金額', '大獎金額', '大獎金額', '大獎金額', '大獎金額']}
            {'roi': [231, 194, 49, 14], 'value': ['15,000', '15,000', '15,000', '15,000', '15,000', '15,000', '15,000', '15,000', '15,000', '15,000'], 'meaning': ['中獎金額', '中獎金額', '中獎金額', '中獎金額', '中獎金額', '中獎金額', '中獎金額', '中獎金額', '中獎金額', '中獎金額']}
            {'roi': [354, 194, 41, 15], 'value': ['7,500', '7,500', '7,500', '7,500', '7,500', '7,500', '7,500', '7,500', '7,500', '7,500'], 'meaning': ['小獎金額', '小獎金額', '小獎金額', '小獎金額', '小獎金額', '小獎金額', '小獎金額', '小獎金額', '小獎金額', '小獎金額']}
            {'roi': [89, 906, 30, 16], 'value': ['500', '500', '500', '500', '500', '500', '500', '500', '500', '500', '500'], 'meaning': ['每局的押注金額', '總押注金額', '總押注金額', '總押注金額', '總押注', '總押注金額', '總押注金額', '總押注金額', '總押注', '總押注金額', '玩家贏得的分數']}
            {'roi': [239, 901, 30, 16], 'value': ['250', '300', '150', '100', '100', '250', '200', '450', '150', '500', '500'], 'meaning': ['玩家贏得的分數', '玩家贏得分數', '玩家贏得的分數', '玩家贏分', '贏分', '玩家贏得的分數', '玩家贏得的分數', '玩家贏分', '玩家贏分', '總押注金額', '玩家贏得的分數']}
            {'roi': [234, 706, 40, 20], 'value': ['300'], 'meaning': ['玩家贏得分數']}
            {'roi': [236, 547, 38, 24], 'value': ['100'], 'meaning': ['玩家贏分']}
            {'roi': [13, 117, 28, 11], 'value': ['200'], 'meaning': ['玩家贏得的分數']}
            {'roi': [373, 70, 83, 13], 'value': ['679,100,112'], 'meaning': ['玩家贏得的分數']}
            
            在上面提供的資料中，你應該保留的有:
            玩家剩餘金額，因為他是重要資訊且它的可信度高。
            巨獎、大獎、中獎、小獎，因為他是重要資訊，而且他們分別是不同的獎項且可信度高，應該全部保留。
            玩家贏得分數，因為他是重要資訊且它的可信度高。
            總押注金額，因為他是重要資訊且它的可信度高。
            其他資訊都應該刪除，因為他們的可信度不高。
        """
    )

# """
#         我正在辨識一款slot game的遊戲畫面中的數字，但我得到數字的數值了，卻不知道它的意義，所以我記錄了這個數字可能的意義。
#         你認為這個數字的意義是什麼，遵守以下條件:
#         1.回答盡量精簡。
#         2.輸出格式<meaning></meaning>，意義要用<meaning></meaning>標籤包起來。
#         """
